package faker

// NameMatrix 姓名母体
type NameMatrix struct {
	matrixs []Matrix
}

// NewNameMatrix 构造一个 NameMatrix
func NewNameMatrix() *NameMatrix {
	xing, _ := NewEnumMatrix([]string{"李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱", "高", "林", "何",
		"郭", "马", "罗", "梁", "宋", "郑", "谢", "韩", "唐", "冯", "于", "董", "萧", "程", "曹", "袁", "邓", "许", "傅", "沈", "曾", "彭",
		"吕", "苏", "卢", "蒋", "蔡", "贾", "丁", "魏", "薛", "叶", "阎", "余", "潘", "杜", "戴", "夏", "钟", "汪", "田", "任", "姜", "范",
		"方", "石", "姚", "谭", "廖", "邹", "熊", "金", "陆", "郝", "孔", "白", "崔", "康", "毛", "邱", "秦", "江", "史", "顾", "侯", "邵",
		"孟", "龙", "万", "段", "漕", "钱", "汤", "尹", "黎", "易", "常", "武", "乔", "贺", "赖", "龚", "文", "庞", "樊", "兰", "殷", "施",
		"陶", "洪", "翟", "安", "颜", "倪", "严", "牛", "温", "芦", "季", "俞", "章", "鲁", "葛", "伍", "韦", "申", "尤", "毕", "聂", "丛",
		"焦", "向", "柳", "邢", "路", "岳", "齐", "沿", "梅", "莫", "庄", "辛", "管", "祝", "左", "涂", "谷", "祁", "时", "舒", "耿", "牟",
		"卜", "路", "詹", "关", "苗", "凌", "费", "纪", "靳", "盛", "童", "欧", "甄", "项", "曲", "成", "游", "阳", "裴", "席", "卫", "查",
		"屈", "鲍", "位", "覃", "霍", "翁", "隋", "植", "甘", "景", "薄", "单", "包", "司", "柏", "宁", "柯", "阮", "桂", "闵", "欧阳", "解",
		"强", "柴", "华", "车", "冉", "房", "边", "辜", "吉", "饶", "刁", "瞿", "戚", "丘", "古", "米", "池", "滕", "晋", "苑", "邬", "臧",
		"畅", "宫", "来", "嵺", "苟", "全", "褚", "廉", "简", "娄", "盖", "符", "奚", "木", "穆", "党", "燕", "郎", "邸", "冀", "谈", "姬",
		"屠", "连", "郜", "晏", "栾", "郁", "商", "蒙", "计", "喻", "揭", "窦", "迟", "宇", "敖", "糜", "鄢", "冷", "卓", "花", "仇", "艾",
		"蓝", "都", "巩", "稽", "井", "练", "仲", "乐", "虞", "卞", "封", "竺", "冼", "原", "官", "衣", "楚", "佟", "栗", "匡", "宗", "应",
		"台", "巫", "鞠", "僧", "桑", "荆", "谌", "银", "扬", "明", "沙", "薄", "伏", "岑", "习", "胥", "保", "和", "蔺"})
	ming, _ := NewEnumMatrix([]string{"一", "东", "丝", "丞", "中", "丹", "为", "丽", "义", "之", "乐", "乒", "乔", "书", "乾", "云", "亚",
		"亦", "亭", "亮", "亿", "仑", "仝", "代", "仪", "伊", "佑", "佩", "佳", "依", "俊", "俞", "信", "俪", "俯", "候", "倩", "倪", "健",
		"偲", "儋", "元", "先", "光", "兰", "兵", "冀", "冉", "冕", "冠", "冰", "凌", "凝", "凡", "凤", "凯", "凰", "函", "利", "力", "劭",
		"劻", "劼", "勋", "勒", "勰", "华", "卓", "博", "卿", "可", "叶", "合", "吉", "君", "含", "和", "哲", "啸", "喆", "嘉", "园", "国",
		"圣", "坚", "坤", "基", "士", "备", "天", "奇", "奕", "妍", "妙", "妤", "妮", "姗", "姝", "姣", "姬", "姹", "姿", "娇", "娜", "娟",
		"娥", "娴", "婉", "婕", "婧", "婵", "婷", "媚", "媛", "媱", "嫣", "嫦", "嫱", "子", "孜", "学", "宁", "宇", "安", "宏", "宛", "宜",
		"宣", "宪", "家", "宸", "容", "宾", "密", "富", "寒", "封", "尧", "展", "山", "岚", "峰", "川", "巧", "帅", "希", "帝", "平", "庭",
		"延", "建", "弓", "弘", "弛", "弢", "弩", "强", "弼", "彤", "彦", "彨", "彩", "彪", "彬", "彭", "彰", "影", "征", "律", "御", "德",
		"心", "志", "忠", "怜", "思", "怡", "恒", "恩", "恬", "悍", "悦", "情", "惠", "慕", "慧", "承", "振", "挺", "掣", "攀", "敏", "文",
		"新", "旁", "日", "旭", "旲", "旷", "旺", "旻", "昂", "昊", "昌", "明", "易", "昕", "星", "春", "昪", "昭", "昮", "昱", "昴", "晋",
		"晓", "晟", "晨", "晴", "晶", "晷", "晸", "智", "曼", "月", "有", "朋", "朕", "朗", "朴", "村", "杰", "林", "枫", "柔", "柴", "栋",
		"桓", "桦", "梅", "梦", "棋", "棠", "森", "楠", "榕", "榜", "欢", "欣", "段", "殿", "毅", "民", "水", "永", "汉", "汗", "江", "汶",
		"沂", "沅", "沛", "沧", "河", "沺", "治", "泉", "泓", "波", "泰", "泽", "洁", "洋", "洲", "浦", "浩", "海", "涓", "涛", "涟", "润",
		"涵", "淇", "淏", "淑", "淳", "清", "渊", "渝", "渺", "源", "溢", "滟", "滢", "漩", "漪", "澉", "澎", "澔", "澜", "濮", "濯", "瀚",
		"瀛", "灏", "灵", "灿", "炜", "烨", "然", "煊", "燕", "爽", "玉", "玟", "玫", "玮", "玲", "珆", "珊", "珍", "珠", "珴", "珸", "琛",
		"琦", "琪", "琬", "琳", "琼", "瑗", "瑛", "瑞", "瑶", "瑾", "璇", "璧", "璨", "生", "皓", "盈", "益", "眉", "真", "知", "砂", "碧",
		"碫", "磊", "示", "社", "祖", "祥", "禅", "秀", "稹", "穆", "章", "竣", "童", "竦", "端", "竹", "策", "筠", "素", "纤", "纯", "纲",
		"纹", "绪", "绮", "维", "综", "缜", "美", "羚", "群", "羽", "翰", "耘", "致", "舒", "舱", "舷", "船", "良", "艳", "艺", "芃", "芊",
		"芝", "芬", "芮", "芯", "花", "芳", "芸", "苑", "苒", "苓", "若", "英", "苹", "茗", "茜", "茵", "茹", "荔", "荣", "荷", "莉", "莎",
		"莱", "莹", "菀", "菁", "菱", "菲", "萌", "萍", "萱", "葆", "蒙", "蒲", "蓉", "蓓", "蓝", "蔓", "蔚", "蕊", "蕾", "薇", "虚", "虹",
		"融", "裕", "襦", "诗", "诚", "诤", "谚", "豪", "豹", "贞", "贤", "贵", "超", "越", "轩", "轼", "辅", "辈", "辉", "达", "迈", "连",
		"逸", "邶", "部", "钊", "钢", "钧", "钰", "铎", "铖", "铠", "铭", "铸", "铿", "锋", "锦", "键", "镇", "阔", "阳", "雁", "雄", "雅",
		"雨", "雪", "霆", "震", "霖", "霜", "霞", "霭", "露", "青", "靖", "静", "韩", "音", "韵", "颁", "颇", "频", "颔", "颖", "颜", "风",
		"飒", "飘", "飙", "飚", "飞", "馗", "香", "馥", "馨", "马", "驹", "驾", "骄", "骏", "骞", "骢", "骥", "高", "魁", "魏", "鲛", "鸣",
		"鸿", "鹰", "黛", "齐", "龄", "龙", "丹烟", "丹珍", "丹秋", "丹萱", "丹雪", "之山", "之柔", "之桃", "之玉", "之瑶", "乐丹", "乐之",
		"乐安", "乐松", "乐枫", "乐珍", "乐瑶", "乐菱", "乐萱", "乐蓉", "乐驹", "书兰", "书双", "书易", "书瑶", "书翠", "书芹", "书萱", "书蕾",
		"书雪", "亦寒", "亦旋", "亦玉", "亦瑶", "亦绿", "从南", "从安", "从寒", "从彤", "从梦", "从灵", "从蓉", "从阳", "从雪", "从霜", "代云",
		"代亦", "代双", "代曼", "代柔", "代梅", "代玉", "代珊", "代真", "代芹", "代荷", "代萱", "以丹", "以亦", "以南", "以寒", "以山", "以柳",
		"以莲", "以菱", "以蓝", "以蕊", "优璇", "伟奇", "伟宸", "伟泽", "伟祺", "伟诚", "佑怡", "佳琦", "依凝", "依娜", "依珊", "依白", "依萱",
		"俊楠", "俊驰", "修杰", "修洁", "倩雪", "健柏", "傲之", "傲云", "傲安", "傲晴", "傲珊", "傲芙", "傲蕾", "元枫", "元柏", "元柳", "元珊",
		"元瑶", "元绿", "元菱", "元霜", "元风", "元香", "冬云", "冬亦", "冬儿", "冬寒", "冬灵", "冬菱", "冰兰", "冰凡", "冰夏", "冰安", "冰彤",
		"冰旋", "冰枫", "冰烟", "冰萍", "冰蓝", "冰露", "冷卉", "冷安", "冷梅", "冷珍", "冷雁", "冷雪", "凌寒", "凌旋", "凌春", "凌晴", "凌珍",
		"凌瑶", "凌菲", "凌萱", "凌薇", "凌雪", "凌青", "凌香", "凝天", "凝梦", "凝海", "凝珍", "凝竹", "凝芙", "凝荷", "凝蝶", "凝阳", "凝雁",
		"凡之", "凡双", "凡旋", "凡松", "凡柔", "凡梅", "凡梦", "凡白", "凡蕾", "凡霜", "初丹", "初南", "初夏", "初彤", "初柔", "初瑶", "初翠",
		"初蝶", "初雪", "初露", "千儿", "千兰", "千凝", "千易", "千琴", "千秋", "千萍", "千雁", "千青", "半安", "半梦", "半芹", "半雪", "半青",
		"南春", "南晴", "南松", "南琴", "南莲", "南蕾", "南露", "南风", "博文", "博涛", "博超", "又晴", "又菡", "又菱", "友儿", "友巧", "友易",
		"友珊", "友瑶", "友绿", "友菱", "友蕊", "可馨", "向卉", "向彤", "向珊", "向萍", "向雪", "君昊", "君浩", "含卉", "含海", "含烟", "含玉",
		"含芙", "含蕾", "含雁", "听兰", "听寒", "听春", "听枫", "听白", "听芹", "听荷", "听蓉", "听露", "哲瀚", "嘉懿", "嘉熙", "国豪", "圣杰",
		"夏岚", "夏彤", "夏柳", "夏槐", "夏菡", "夏蓉", "夏青", "夜云", "夜天", "夜安", "夜山", "夜春", "夜柳", "夜白", "夜蓉", "夜蕾", "天亦",
		"天佑", "天宇", "天巧", "天春", "天瑜", "天真", "天磊", "天荷", "如之", "如南", "如天", "如曼", "如松", "如柏", "如波", "如萱", "如霜",
		"如风", "妙彤", "妙旋", "妙春", "妙晴", "妙松", "妙柏", "妙海", "妙竹", "妙菡", "妙菱", "娅楠", "婉婷", "婕珍", "婧琪", "婳祎", "嫦曦",
		"子轩", "子骞", "子默", "孤丝", "孤岚", "孤萍", "孤风", "安卉", "安南", "安容", "安筠", "安荷", "安蕾", "安雁", "安露", "宛儿", "宛凝",
		"宛海", "宛白", "宛筠", "寄凡", "寄春", "寄灵", "寄瑶", "寄真", "寒云", "寒凡", "寒安", "寒松", "寒珊", "寒荷", "寒雁", "寒香", "寻凝",
		"寻南", "寻双", "寻文", "寻春", "寻桃", "寻真", "寻芹", "寻雁", "寻雪", "小凡", "小夏", "小玉", "小珍", "小萱", "小霜", "尔岚", "尔曼",
		"尔珍", "尔琴", "尔白", "尔芙", "展鹏", "山柏", "山柳", "山雁", "峻熙", "巧春", "巧绿", "巧风", "平夏", "平安", "平春", "平绿", "平蝶",
		"幻丝", "幻柏", "幻桃", "幻波", "幻灵", "幻珊", "幻竹", "幻莲", "幼丝", "幼南", "幼晴", "幼柏", "幼珊", "幼翠", "幼萱", "幼蓉", "建辉",
		"弘文", "彦妮", "忆丹", "忆南", "忆寒", "忆山", "忆彤", "忆柏", "忆柳", "忆梅", "忆翠", "忆霜", "忆香", "志强", "志泽", "念云", "念双",
		"念寒", "念桃", "念波", "念烟", "念珍", "念真", "念芹", "念薇", "念露", "怀亦", "怀柔", "怀萍", "怀蕊", "怀蝶", "怜云", "怜容", "怜寒",
		"怜晴", "怜梦", "怜菡", "怜蕾", "思天", "思淼", "思源", "思聪", "思菱", "思远", "怡香", "恨之", "恨天", "恨寒", "恨山", "恨松", "恨玉",
		"恨瑶", "恨荷", "恨蝶", "恨风", "惜文", "惜海", "惜灵", "惜雪", "惜霜", "惠茜", "慕儿", "慕凝", "慕晴", "慕梅", "慕灵", "慕青", "懿轩",
		"振家", "擎宇", "擎苍", "文博", "文昊", "文轩", "新之", "新冬", "新巧", "新柔", "新波", "新瑶", "新蕾", "旭尧", "昊天", "昊强", "昊焱",
		"昊然", "明杰", "明美", "明轩", "明辉", "易容", "易巧", "易梦", "易烟", "易真", "映之", "映容", "映寒", "映易", "映梦", "映波", "映真",
		"映秋", "春儿", "春冬", "春文", "春枫", "春柏", "春梅", "春竹", "春绿", "春翠", "春雁", "晋鹏", "晓亦", "晓兰", "晓凡", "晓博", "晓啸",
		"晓夏", "晓巧", "晓曼", "晓槐", "晓灵", "晓瑶", "晓绿", "晓霜", "晟睿", "智宸", "智渊", "曼寒", "曼文", "曼易", "曼柔", "曼梅", "曼玉",
		"曼荷", "曼香", "月婵", "桑榆", "梦安", "梦容", "梦寒", "梦岚", "梦旋", "梦易", "梦曼", "梦松", "梦柏", "梦槐", "梦洁", "梦琪", "梦瑶",
		"梦璐", "梦菡", "梦菲", "梦露", "梦香", "楷瑞", "檀雅", "欢馨", "欣妍", "歆瑶", "正梅", "正豪", "水云", "水桃", "水瑶", "水绿", "水香",
		"沐卉", "沛儿", "沛文", "沛玲", "沛珊", "沛芹", "沛菡", "沛萍", "泽洋", "浩南", "浩宇", "浩然", "浩轩", "海云", "海冬", "海安", "海桃",
		"海瑶", "海莲", "海蓝", "海雪", "海露", "涵双", "涵山", "涵柏", "涵柳", "涵瑶", "涵菡", "涵蕾", "涵雁", "淑颖", "漫妮", "灵槐", "灵波",
		"灵竹", "灵芸", "灵薇", "灵阳", "灵雁", "炎彬", "炫明", "烨伟", "烨华", "烨磊", "烨霖", "煜城", "煜婷", "煜祺", "熙雯", "熠彤", "玉珍",
		"玥婷", "玥怡", "珺瑶", "琪涵", "瑾瑜", "瑾萱", "璟雯", "痴旋", "痴梦", "痴灵", "痴珊", "痴香", "白凝", "白凡", "白卉", "白山", "白易",
		"白晴", "白枫", "白桃", "白梅", "白秋", "白薇", "皓轩", "盼丹", "盼儿", "盼兰", "盼夏", "盼山", "盼巧", "盼曼", "盼柳", "盼海", "盼烟",
		"盼翠", "盼雁", "盼香", "睿婕", "睿渊", "碧凡", "碧彤", "碧曼", "碧灵", "碧玉", "碧琴", "碧菡", "秋双", "秋春", "秋柏", "秋柔", "秋柳",
		"秋灵", "秋烟", "秋白", "秋翠", "秋荷", "秋蝶", "立果", "立诚", "立轩", "立辉", "笑天", "笑寒", "笑怡", "笑愚", "笑珊", "笑白", "笑蓝",
		"笑霜", "紫丝", "紫南", "紫安", "紫寒", "紫山", "紫文", "紫易", "紫槐", "紫真", "紫翠", "紫菱", "紫蓝", "紫雪", "紫霜", "紫青", "绍辉",
		"绮兰", "绮彤", "绮梅", "绮玉", "绮琴", "绮菱", "绿夏", "绿春", "绿海", "绿真", "美琳", "美莲", "美萱", "羽馨", "翠丝", "翠安", "翠容",
		"翠岚", "翠彤", "翠曼", "翠柔", "翠桃", "翠琴", "翠绿", "翠芙", "翠萱", "翠风", "聪健", "致远", "芷卉", "芷巧", "芷文", "芷珍", "芷荷",
		"芷蕊", "芷蕾", "芸熙", "芸萱", "苑博", "苑杰", "若南", "若烟", "若翾", "若菱", "英杰", "茹雪", "荣轩", "莉姿", "觅双", "觅柔", "觅波",
		"觅海", "觅珍", "觅翠", "觅荷", "觅风", "访云", "访卉", "访旋", "访枫", "访烟", "访琴", "访蕊", "访风", "诗云", "诗柳", "诗珊", "诗琪",
		"诗茵", "诗蕊", "诗霜", "语兰", "语堂", "语嫣", "语山", "语琴", "语芙", "语蓉", "语蝶", "语风", "谷丝", "谷云", "谷冬", "谷南", "谷山",
		"谷波", "谷秋", "谷菱", "谷雪", "越彬", "越泽", "辰逸", "迎夏", "迎曼", "迎松", "迎梦", "迎波", "迎海", "迎蓉", "远航", "醉山", "醉易",
		"醉柳", "醉波", "醉蓝", "醉薇", "醉蝶", "采文", "采白", "采绿", "金鑫", "鑫磊", "鑫鹏", "钰彤", "锦程", "问兰", "问夏", "问安", "问旋",
		"问枫", "问柳", "问筠", "问蕊", "问雁", "雁卉", "雁枫", "雁玉", "雁菱", "雅山", "雅彤", "雅柏", "雅柔", "雅琳", "雅琴", "雅绿", "雅芙",
		"雅蕊", "雅阳", "雅霜", "雅静", "雨兰", "雨双", "雨嘉", "雨婷", "雨寒", "雨泽", "雨珍", "雨真", "雨雪", "雪丽", "雪兰", "雪巧", "雪慧",
		"雪旋", "雪松", "雪枫", "雪柳", "雪瑶", "雪萍", "雪雁", "雪青", "青丝", "青亦", "青寒", "青曼", "青槐", "青烟", "青筠", "青香", "靖儿",
		"靖巧", "靖易", "靖柏", "靖琪", "靖瑶", "靖雁", "静宸", "静曼", "静枫", "静琪", "静璇", "静竹", "静芙", "静香", "韵寒", "风华", "飞松",
		"飞柏", "飞槐", "飞绿", "飞阳", "飞雪", "飞风", "香卉", "香寒", "香巧", "香怡", "香春", "香柏", "香梅", "香波", "香芹", "香茹", "香莲",
		"香菱", "香萱", "香薇", "香蝶", "香露", "馨彤", "馨蕊", "鸿涛", "鸿煊", "鹏涛", "鹏煊", "鹏飞", "鹤轩", "鹭洋", "黎昕", "乐姗"})

	matrixs := []Matrix{xing, ming}

	return &NameMatrix{
		matrixs,
	}
}

// Breed 实现接口matrix
func (m *NameMatrix) Breed() string {
	return m.matrixs[0].Breed() + m.matrixs[1].Breed()
}
